tutorials/incompressible/pimpleHFDIBFoam/sphereSphereWall2D/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bodyNames ("sphere_Top" "sphere_Bot");

interpolationSchemes
{
  //~ U cellPointFace;
  U cell;
}

// fluid flow auxiliary settings
surfaceThreshold                1e-4;
nDragForceSmoothingIterations   0;
nDirectForcingIterations        20;
immersedUTolerance              1e-6;

// DEM settings
stepDEM     0.01;
// stepDEM     1;

// adaptive DEM stepping option (sub-cycling of contacting bodies)
// adaptiveStepDEM true;
// adaptiveStepDEMDict
// {
//     DEMdtEstimator  velocityAware; // or conservative
//     sweepSafetyTrans 1.5;
//     sweepSafetyRot   3.0;
//     minDEMdt         0;
//     maxDEMSubCycles  0; // 0 = unlimited
// }

geometricD (1 1 -1);
recordSimulation true;
recordFirstTimeStep false;

outputSetup
{
    basic true;
    iB  true;
    DEM true;
    addModel false;
    parallelDEM true;
}
DEM
{
	LcCoeff 4.0;
	rotationModel chen2012;
	// rotationModel mindlin1953	
    materials
    {
        particle
        {
            Y       1e8;
            nu      0.0;
            mu      0;
            adhN    0;
			eps	 	1;
        }
        
        wall
        {
            Y       1e8;
            nu      0.0;
            mu      0;
            adhN    0;
			eps	 	1;
        }
    }

	cyclicPatches
	{
	} 

    collisionPatches
    {
		wall0
		{
			material wall;
			nVec (1.0 0.0 0.0);
			planePoint (0.015 0.00 0.0);
		}
		wall1
		{
			material wall;
			nVec (0.0 1.0 0.0);
			planePoint (0.00 0.05 0.0);
		}
		wall2
		{
			material wall;
			nVec (0.0 -1.0 0.0);
			planePoint (0.00 -0.05 0.0);
		}

		wall3
		{
			material wall;
			nVec (-1.0 0.0 0.0);
			planePoint (-0.015 0.0 0.0);
		}
    }
}

virtualMesh
{
    level 4;
    charCellSize 0.001;
    recordContact false;
}

sphere_Top
{

	fullyCoupledBody
	{
		velocity (0 -1.0 0);
	}

	rho         rho [1 -3 0 0 0 0 0] 4000;

	refineMC 5;

	U
	{
	BC  noSlip;
	}

	bodyAddition
	{
		addModel   once;//<-constant, only once
		onceCoeffs{}
	}
		
	material particle;
	bodyGeom sphere;
	sphere
	{
		radius 0.01;
		startPosition (0 0.035 0);
	}

	updateTorque false;
	sdBasedLambda false;
	interfaceSpan 1.0;
	startSynced false;
	refineBuffers 1;
	timesToSetStatic -1;
	
}

sphere_Bot
{
	staticBody;

	rho         rho [1 -3 0 0 0 0 0] 4000;

	refineMC 5;

	U
	{
	BC  noSlip;
	}

	bodyAddition
	{
		addModel   once;//<-constant, only once
		onceCoeffs{}
	}
		
	material particle;
	bodyGeom sphere;
	sphere
	{
		radius 0.01;
		startPosition (0 -0.035 0);
	}

	updateTorque false;
	sdBasedLambda false;
	interfaceSpan 1.0;
	startSynced false;
	refineBuffers 1;
	timesToSetStatic -1;
	
}

// ************************************************************************* //

