tutorials/incompressible/pimpleHFDIBFoam/sphereSphereWall2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleHFDIBFoam;

startFrom       latestTime; //startTime;

startTime       0;

stopAt          endTime;

endTime         0.2;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   1e-2;


purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

maxCo           0.25;

maxDeltaT       1e-3;

adjustTimeStep  yes;

runTimeModifiable yes;

// ************************************************************************* //
